// შექმენით ახალი ExpressJS პროექტი და შეასრულეთ შემდეგი პუნქტები:

// 1) რეგისტრაცია და ავტორიზაცია
// განახორციელეთ რეგისტრაცია და ავტორიზაცია (როგორც ნაჩვენებია ლექციაზე).

// 2) მომხმარებლის მოდელი
// თითოეულ მომხმარებელს უნდა ჰქონდეს შემდეგი ველები:
// - fullName
// - email
// - password
// - birthDate
// - blogs (ბლოგების მასივი)

// 3) ბლოგის მოდელი და CRUD ფუნქციონალი
// შექმენით ბლოგებისთვის სრული CRUD ფუნქციონალი — შექმნა, წაკითხვა, განახლება, წაშლა.თითოეულ ბლოგს უნდა ჰქონდეს:
// - title
// - content
// - author

// 4) მონაცემთა რელაცია
// როდესაც ბლოგი იშლება, მისი ID უნდა წაიშალოს შესაბამისი მომხმარებლის blogs მასივიდან.
// როდესაც მომხმარებელი იშლება, უნდა წაიშალოს ყველა ბლოგი, რომელიც მას ეკუთვნის.

// 5) ავტორიზაციის Middleware
// ყველა ბლოგის როუტი დაიცავით isAuth middleware-ით.

// 6) ბლოგის მფლობელობა
// მომხმარებელს უნდა შეეძლოს მხოლოდ საკუთარი ბლოგის განახლება ან წაშლა (სხვაზე ვერ იმოქმედებს). ანუ შეამოწმეთ განახლების ნამდვილად მის შექმნილ ბლოგს ანახლებს ან შლის თუ არა.

// 7) zod ვალიდაცია
// დაამატეთ zod ვალიდაცია მომხმარებლისა და ბლოგის მოდელებზე:

// რესურსი: https://github.com/Datodia/express-auth
// https://github.com/Datodia/Gita-backend-3/tree/main/Lec14
