// 1) დაწერეთ todo-cli ხელსაწყო ქომანდერის გამოყენებით რომელსაც ექნება შემდეგი ფუნცქიონალი:
// todo-cli show => დააბრუნებს ყველა თუდუს ობიექტს
// todo-cli add todoName => დაგიბრუნებთ ახალ შექმნილ თუდუს
// todo-cli delete todoId => დაგიბრუნებთ წაშლილ თუდუს
// todo-cli todoId --name todoName => დაგიბრუნებთ განახლებულ თუდუს.
// თუდუს ობიექტს უნდა გამოიყურებოდეს: {id: 1, title: "ReadBook", isDone: false}
// შეგიძლიათ დაამატოთ სხვადასხვა ფროფერთიები, გაითვალისიწნეთ განახლება უნდა მოხდეს option მეთოდით.

// ამოხნა მოცემულია todo.js ფაილში
// გაუშვით run npm start-todo

// 2) გააკეთეთ weather-cli ხელსაწყო რომელსაც ექნება შემდეგი ფუნქციონალი:
// weather-cli tbilisi => დაგიბრუნებთ თბილისში რა ამინდია იმას, თუ ისეთ ქალაქს ჩაწერთ რაც არ იძებნება დააბრუნეთ შესაბამისი ერორი.
// ამინდის ინფორმაცია უნდა წამოიღოთ შემდეგი ეიპიაიდან: https://api.openweathermap.org/data/2.5/weather?q={cityName}&units=metric&appid=895284fb2d2c50a520ea537456963d9c
// cityName ის ნაცვლად უნდა გამოიყენოთ არგუმენტად მიღებული ქალაქის სახელი და გამოაჩინოთ შესაბამისი მონაცემები.

// ამოხნა მოცემულია weather.js ფაილში
// გაუშვით run npm start-weather

// რეფერენსი: npm i commander, npm link, #!/usr/bin/env node.
// შეგიძლიათ გამოიყენოთ npm i chalk რომ ტერმინალში უფრო ლამაზად გამოჩნდეს ბრძანებები.
